[
  {
    "title": "requirment1",
    "requirement id": 1,
    "description": "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment2",
    "requirement id": 2,
    "description": "The solution should provide detailed context-sensitive help material for all the possible actions and scenarios on all user interfaces in the application.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment3",
    "requirement id": 3,
    "description": "The solution should provide an interface for the user to log any defects or enhancement requests on the application and track thereafter.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment4",
    "requirement id": 4,
    "description": "The solution should send alerts (e.g., email, SMS) to the user if the user chooses to whenever any action has been taken on the alert.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment5",
    "requirement id": 5,
    "description": "The solution should enable the user to track the submitted defect or enhancement request.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment6",
    "requirement id": 6,
    "description": "The solution should enable the help-desk user to view the reports on the submitted defects or enhancement requests category-wise, status-wise, and age- wise.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment7",
    "requirement id": 7,
    "description": "The support solution should be accessible to the users both from within the application and also outside the application through a browser interface.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment8",
    "requirement id": 8,
    "description": "An audit trail is a record of actions taken by either the user or the system triggers. This includes actions taken by users or Administrators, or actions initiated automatically by the system as a result of system parameters. The System must keep an unalterable audit trail capable of automatically capturing and storing information about: All the actions (create/read/update/delete) that are taken upon the critical entities (case, suspect, property,...) in the system The user initiating and or carrying out the action;The date and time of the event.Administrative parameters The word unalterable is to mean that the audit trail data cannot be modified in any way or deleted by any user; it may be subject to re-department and copying to removable media if required, so long as its contents remain unchanged.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment9",
    "requirement id": 9,
    "description": "Once the audit trail functionality has been activated, the System must track events without manual intervention, and store in the audit trail information about them.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment10",
    "requirement id": 10,
    "description": "The System must maintain the audit trail for as long as required, which will be at least for the life of the case to which it refers.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment11",
    "requirement id": 11,
    "description": "The System must ensure that audit trail data is available for inspection on request, so that a specific event can be identified and all related data made accessible, and that this can be achieved by authorised external personnel who have little or no familiarity with the system.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment12",
    "requirement id": 12,
    "description": "The System must be able to export audit trails for specified cases (without affecting the audit trail stored by the System). This functionality can be used by external auditors who wish to examine or analyse system activity.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment13",
    "requirement id": 13,
    "description": "The System must be able to capture and store violations (i.e. A user's attempts to access a case to which he is denied access), and (where violations can validly be attempted) attempted violations, of access control mechanisms.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment14",
    "requirement id": 14,
    "description": "The System must at a minimum be able to provide reports for actions on cases organised: By case;By user;In chronological sequence.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment15",
    "requirement id": 15,
    "description": "The System should be able to provide reports for actions on cases organised by workstation and (where technically appropriate) by network address.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment16",
    "requirement id": 16,
    "description": "The System must allow the user to limit access to cases to specified users or user groups.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment17",
    "requirement id": 17,
    "description": "The system should provide for role-based control for the functionality within the system",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment18",
    "requirement id": 18,
    "description": "The System must allow a user to be a member of more than one group.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment19",
    "requirement id": 19,
    "description": "The System must allow only admin-users to set up user profiles and allocate users to groups.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment20",
    "requirement id": 20,
    "description": "The System should allow a user to stipulate which other users or groups can access cases.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment21",
    "requirement id": 21,
    "description": "The System must allow changes to security attributes for groups or users (such as access rights, security level, privileges, password allocation and management) to be made only by super-user.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment22",
    "requirement id": 22,
    "description": "If a user requests access to, or searches for, a case which he does not have the right to access, the System must provide one of the following responses (selectable at configuration time): display title and metadata;display the existence of a case but not its title or other metadata;do not display any case information or indicate its existence in any way. These options are presented in order of increasing security. Note that the requirement in the third option (i.e. the most stringent) implies that the System must not include such cases in any count of search results; this level of security is normally appropriate for cases dealing with matters such as national security.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment23",
    "requirement id": 23,
    "description": "If a user performs a quick or advanced search, the System must never include in the search result list any record which the user does not have the right to access.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment24",
    "requirement id": 24,
    "description": "If the System allows users to make unauthorised attempts to access cases, it must log these in the audit trail.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment25",
    "requirement id": 25,
    "description": "Any access to cases, and all other activities involving the cases and related documents or data should also need to be stored in the audit trail to ensure legal admissibility and to assist in data recovery.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment26",
    "requirement id": 26,
    "description": "All error messages produced by the System must be meaningful, so that they can be appropriately acted upon by the users who are likely to see them. Ideally, each error message will be accompanied by explanatory text and an indication of the action(s) which the user can take in response to the error.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment27",
    "requirement id": 27,
    "description": "The System must employ a single set of user interface rules, or a small number of sets to provide a familiar and common look and feel for the application.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment28",
    "requirement id": 28,
    "description": "The System must be able to display several entities (cases, suspects) simultaneously.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment29",
    "requirement id": 29,
    "description": "The interfaces must be made customizable or user-configurable to the extent possible. (e.g., the displayed columns in the table, move, resize, modify the appearance). Such configurations must be saved in the user profile.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment30",
    "requirement id": 30,
    "description": "The System user interface must be suitable for users with special needs; that is, compatible with specialist software that may be used and with appropriate interface guidelines",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment31",
    "requirement id": 31,
    "description": "The System must provide End User and Administrator functions which are easy to use and intuitive throughout.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment32",
    "requirement id": 32,
    "description": "The System must allow persistent defaults for data entry where desirable. These defaults should include: user-definable values;values same as previous item;values derived from context, e.g. date, file reference, user identifier;",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment33",
    "requirement id": 33,
    "description": "Frequently-executed System transactions must be designed so that they can be completed with a small number of interactions (e.g. mouse clicks).",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment34",
    "requirement id": 34,
    "description": "Where the System employs a graphical user interface, it must allow users to customise it. Customisation should include, but need not be limited to the following changes:           menu contents;layout of screens;use of function keys;on-screen colours, fonts and font sizes;",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment35",
    "requirement id": 35,
    "description": "The user interfaces should be designed to make them user-intuitive.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment36",
    "requirement id": 36,
    "description": "The user interfaces of the system should comply with Standard ISO 9241.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment37",
    "requirement id": 37,
    "description": "ICT accessibility: ISO 9241-20 shall be the standard for guidance on ICT accessibility. Application user interfaces to meet its requirements and recommendations. Software accessibility ISO 9241-171 shall be the standard for guidance on software accessibility. User interfaces should meet its requirements and recommendations. Content accessibility WCAG 1.0 shall be the standard used for guidance on content accessibility. The application logo to be available on all pages as a link to the home page.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment38",
    "requirement id": 38,
    "description": "Providing text equivalents for non-text media objects: All non-text media objects, such as graphical images or video, should be provided with alternative equivalent textual descriptions and/or with equivalent text-based functionality.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment39",
    "requirement id": 39,
    "description": "Making navigation self-descriptive: Navigation should be designed to help users understand where they are, where they have been and where they can go next. General guidance on achieving self-descriptiveness is given in ISO 9241-110.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment40",
    "requirement id": 40,
    "description": "Showing users where they are: Each presentation segment (page or window) should provide the user with a clear and sufficient indication of where he or she is in the navigation structure and of the current segment position with respect to the overall structure.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment41",
    "requirement id": 41,
    "description": "Offering alternative access paths: Alternative access paths for navigating to a specific unit of content should be offered to support different navigation strategies.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment42",
    "requirement id": 42,
    "description": "Minimizing navigation effort: The number of navigation steps needed to reach a certain piece of content should be minimized as long as different mental models, navigation strategies and tasks of the user are taken into account.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment43",
    "requirement id": 43,
    "description": "Splash screens should be avoided unless they provide useful content or feedback about the application state to the user. If a splash screen is used, a navigation option to skip it should be offered.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment44",
    "requirement id": 44,
    "description": "Avoiding opening unnecessary windows: Additional windows such as new browser windows or pop-up windows should only be opened if this supports the user's task. Opening new windows can distract, confuse or impede users for a variety of reasons. They can superimpose the primary window, hiding relevant information. They could make it cognitively more difficult to understand the navigation structure with negative effects on both usability and accessibility. They also require additional user actions for closing unwanted windows.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment45",
    "requirement id": 45,
    "description": "Vertical scrolling should be minimized. This may be done by placing important information at the top and providing links to information that is further down the page. Horizontal scrolling should be avoided wherever possible.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment46",
    "requirement id": 46,
    "description": "Designing for input device independence: User interfaces should be designed to allow activation of controls by a variety of input devices. The ability to choose between different input devices for activating controls such as links, fields and buttons is important both for users who prefer a certain input mode, mobile users and users with disabilities. In general, device independence can be achieved if the functionality is operable via a keyboard.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment47",
    "requirement id": 47,
    "description": "Making user interfaces robust: User interfaces should be designed to be as robust as possible in the face of changing technology. This encompasses being able to present content containing newer technologies by older user agents as well as designing content to be usable with future technologies.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment48",
    "requirement id": 48,
    "description": "Acceptable opening / download times: Application pages should be designed and implemented so that there are acceptable opening times and download times for the expected range of technical contexts of use (e.g. bandwidth between the application and the user). This is particularly important for frequently accessed pages or pages that are important for user navigation and exploration, such as the home page.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment49",
    "requirement id": 49,
    "description": "Minimizing user errors: Potential user errors as well as the effort needed to recover from errors should be minimized.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment50",
    "requirement id": 50,
    "description": "Providing clear error messages: The content of error messages shown on the pages or special error pages should clearly state the reason why the error occurred and, if possible, actions the user can take to resolve the error. Users expect error messages to be in the same language as the user interface.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment51",
    "requirement id": 51,
    "description": "Using appropriate formats, units of measurement or currency: When designing user interfaces for use by diverse groups, input and output of information elements such as currency, units of measurement, temperatures, date and time, phone numbers, address or postal codes should be designed so that they are usable.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment52",
    "requirement id": 52,
    "description": "Making text resizable by the user: Text should be able to be resized by the user, using functions provided by the user agent or other appropriate means i.e. see ISO 9241-171.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment53",
    "requirement id": 53,
    "description": "Text quality: The quality of textual content with respect to spelling and grammar should be sufficient so as not to impede readability.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment54",
    "requirement id": 54,
    "description": "Writing style: The reading and understanding of the textual content on the screen should be supported by suitable means, including the use of short sentences, the division of the text into shorter chunks or the presentation of content items in the form of bullet points.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment55",
    "requirement id": 55,
    "description": "Supporting text skimming: Fast skimming of text should be supported by the provision of clear links, bulleted lists, highlighted keywords, logical headings, and short phrases and sentences.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment56",
    "requirement id": 56,
    "description": "Readability of text: Text presented on the pages should be readable taking into account the expected display characteristics and spatial arrangement. ISO 9241-303 shall be consulted for screen text legibility requirements.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment57",
    "requirement id": 57,
    "description": "Distinguishable within-page links: Within-page links should be clearly distinguishable from other links that lead to a different page. EX. Within-page links are shown with dashed rather than solid underlines",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment58",
    "requirement id": 58,
    "description": "Avoiding link overload: Text pages containing large proportions of links should be formatted so that the presence of links does not impede the readability of the text.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment59",
    "requirement id": 59,
    "description": "Using familiar terminology for navigation links: Navigation links  particularly links representing the main navigation structure  shoul`d be labelled with terms that are familiar to the user, based on his/her general knowledge, prior experience in the application domain or experience of using other systems.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment60",
    "requirement id": 60,
    "description": "Using descriptive link labels: The target or purpose of a link should be directly indicated by its label, avoiding generic labels such as go or click here except where the purpose of the link is clear from its context on the page or the labels have commonly understood semantics in the particular application domain. Using appropriate terminology specific to the user's tasks and information needs is important for making the content easy to understand.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment61",
    "requirement id": 61,
    "description": "Marking links opening new windows: Links that open new browser windows or pop-up windows should be clearly marked.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment62",
    "requirement id": 62,
    "description": "Distinguishing navigation links from controls: Navigation links should be clearly distinguishable from controls activating some action. Typical action types in user interfaces include manipulating application data, performing searches, communication actions, such as opening a new e-mail window or starting a chat function, and presentation-related actions, such as sorting a list of search results.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment63",
    "requirement id": 63,
    "description": "Providing printable document versions: If a document is either too long, dispersed over several pages or in a specific layout that is not suitable for online reading, a printer-friendly version of the document should be provided that prints the content in a form acceptable to the user (e.g. in the expected layout, paper format, or orientation).",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment64",
    "requirement id": 64,
    "description": "Use of white space: White space on a page i.e. space filled only with the background color should be used in such a way that it does not impair the visual skimming of the page. While white space is an important means of visually organizing the different content elements on a page, if the distance between the blocks of information displayed becomes too large, rapid skimming of the page can be impeded.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment65",
    "requirement id": 65,
    "description": "Selecting appropriate page lengths The length of a page should be selected so as to support the primary purpose and use of the page. Short pages are generally more appropriate for homepages, navigation pages, or overview pages that need to be read quickly. Longer pages can be more appropriate when users want to read the content without interruptions or when the page needs to match a paper counterpart.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment66",
    "requirement id": 66,
    "description": "Using colour: Colour should be used with care, taking into account human capabilities and restrictions in perceiving colour, and not as the only means of conveying information. Color should never be the only means of coding. Some users may have difficulties in perceiving certain colors or color combinations (color-blindness).",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment67",
    "requirement id": 67,
    "description": "Using frames with care: If frames are used, care should be taken to avoid possible problems, for example, those involving the use of the back button, bookmarking of pages, or scrolling of information. When frames are used, it is important to title each frame, and to describe its purpose and how frames relate to one another other.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment68",
    "requirement id": 68,
    "description": "Providing alternatives to frame-based presentation: If frames are used, an alternative way of presenting relevant information without frames should be provided. Providing alternative text-only pages: When style sheets and/or frames are turned off it should be possible for the user to read and understand the page; alternatively, the user should be provided with an equivalent alternative text-only page.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment69",
    "requirement id": 69,
    "description": "Consistent page layout: Pages should be designed using consistent layout schemes, supporting the user in finding similar information at the same position on different pages. Overall layout schemes apply to all pages and are preferable when all pages have a similar structure. Frequently, however, different pages have different purposes and types of content. In such cases, pages can usually be grouped in different categories, using one layout scheme for each category consistently.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment70",
    "requirement id": 70,
    "description": "Placing title information consistently: Page titles should be placed in a consistent location on the different pages.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment71",
    "requirement id": 71,
    "description": "Observing principles of human perception When designing application pages, the general principles of human perception should be taken into account. The International Standards mentioned below shall be consulted for guidance. Practical guidelines for presenting information to the user are to be found in ISO 9241-12. Guidance on selecting and using different forms of interaction techniques is to be found in ISO 9241-14 to ISO 9241-17. ISO 9241-14 gives guidance about menus, ISO 9241-15 about command dialogues, ISO 9241-16 about direct manipulation and ISO 9241-17 about forms. In addition, when designing multimedia information presentations, the design principles and recommendations described in ISO 14915-1 to ISO 14915-3 should be taken into account. Appropriate content presentation also plays a key role in accessibility.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment72",
    "requirement id": 72,
    "description": "Linking back to the home page or landmark pages: Each page should contain a link leading to the home page of the application or to a landmark page that is easy to recognize for the user.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment73",
    "requirement id": 73,
    "description": "Providing a site map: A separate navigation overview such as a site map should be provided for application showing the structure of the site in an overview form.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment74",
    "requirement id": 74,
    "description": "Consistency between navigation components and content: If navigation components (or overviews) are shown in conjunction with associated content, consistency between the navigation component and the content shown should be maintained by indicating in the navigation component (e.g. highlighting) the topic currently visible in the content area.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment75",
    "requirement id": 75,
    "description": "Placing navigation components consistently: Navigation components should be placed consistently on the pages or in the framesets in the pages of the application.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment76",
    "requirement id": 76,
    "description": "Individualization and user adaptation : Adapting the content and the navigation of a user interface to individual users or user groups can be a useful mechanism for providing information that is of interest to the users and for making access to relevant information more efficient. User adaptation can also be important for making the user interface more accessible. Different approaches can be used for achieving these goals, like providing users with means for customizing the user interface to their personal needs i.e. individualization designing content and navigation differently for varying user groups or roles i.e. such as employees of different levels, citizens etc, monitoring the user's behaviour and adapting to the user's goals that are inferred from the behaviour observed, recommending information that is potentially more relevant or interesting to the specific user, based on the behaviour of all users or a user group.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment77",
    "requirement id": 77,
    "description": "Taking account of the users' tasks and information needs: When providing different access paths or navigation structures for different user groups, the tasks and information needs of these user groups should be taken into consideration.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment78",
    "requirement id": 78,
    "description": "Making individualization and adaptation evident: It should be made evident to the user when individualization and/or adaptation are used.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment79",
    "requirement id": 79,
    "description": "Making user profiles evident: If predefined user profiles or user-specified profiles are used for individualizing or adapting content, the profile currently used should be made evident. If profiles are used, it is important to provide users with information about this concept and its implications.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment80",
    "requirement id": 80,
    "description": "Allowing users to see and change profiles: If user-specified profiles are used, users should be able to see, modify and delete that profile on demand.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment81",
    "requirement id": 81,
    "description": "The user interfaces of the system should follow the guidelines specified under www.usability.gov",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment82",
    "requirement id": 82,
    "description": "The System must be available to users:            from <xx:00> to <xx:00>; on <all weekdays/xxx days per year>.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment83",
    "requirement id": 83,
    "description": "The planned downtime for the System must not exceed <xx> hours per <rolling three month period>.           The System is considered to be down if any user is unable to perform any normal System function and if this failure is attributed to any component of the System other than the workstation.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment84",
    "requirement id": 84,
    "description": "Unplanned downtime for the System must not exceed <xx hours/minutes> per <rolling three month period>.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment85",
    "requirement id": 85,
    "description": "The number of incidents of unplanned downtime for the System must not exceed <x> per <rolling three month period>.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment86",
    "requirement id": 86,
    "description": "In the event of any software or hardware failure, it must be possible to restore the System (with inline synchronization) within no more than <xx> hours.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment87",
    "requirement id": 87,
    "description": "The System must provide adequate response times for commonly performed functions under both standard and peak conditions",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment88",
    "requirement id": 88,
    "description": "The System must be able to perform a simple search within 5-8 seconds and a advanced search (multiple search criteria) within 10-15 seconds regardless of the storage capacity or number of cases in the system. In this context, performing a search means returning a result list. It does not include retrieving the records themselves.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment89",
    "requirement id": 89,
    "description": "The System must be able to retrieve and display within 5-8 seconds the case which has been accessed within the previous 2 months, regardless of storage capacity or number of cases in the system. This requirement is intended to allow for rapid retrieval of frequently-used cases, on the understanding that frequency of use is typically correlated with recent use.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment90",
    "requirement id": 90,
    "description": "The System must be able to retrieve and display within 20 seconds the case which has not been accessed within the previous 2 months, regardless of storage capacity or number of cases in the system. This requirement is intended to allow for cases where cases used infrequently are stored on slower media than more active records.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment91",
    "requirement id": 91,
    "description": "The System be scaleable and must not have any features which would preclude use in small or large police stations, with varying numbers of cases handled.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment92",
    "requirement id": 92,
    "description": "The system should support multilingual interface",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment93",
    "requirement id": 93,
    "description": "The system should be designed in manner that operational data is not lost in case of any                failure of equipment or communication network.",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment94",
    "requirement id": 94,
    "description": "The system should work even in an offline mode with the critical functionality",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment95",
    "requirement id": 95,
    "description": "The system should be designed to have satisfactory performance even in Police Stations                connected on low-bandwidth",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment96",
    "requirement id": 96,
    "description": "The system should be implemented using Service Oriented Architecture (SOA) and have a                modular design",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment97",
    "requirement id": 97,
    "description": "The system should be developed on Open Standards",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment98",
    "requirement id": 98,
    "description": "The system should be built on a common User Access and Authentication Service to                ensure Single-Sign on for the end-user",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment99",
    "requirement id": 99,
    "description": "The system should be developed for a centralized deployment and maintenance",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment100",
    "requirement id": 100,
    "description": "The system should be developed to be deployed in a 3-tier datacenter architecture",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment101",
    "requirement id": 101,
    "description": "The system should be designed to have a n-tier architecture with the presentation logic                separated from the business logic that is again separated from the data-access logic",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment102",
    "requirement id": 102,
    "description": "The system should be extensible to provide access to the interfaces through PDA's and                mobile data terminals",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment103",
    "requirement id": 103,
    "description": "The system should adopt standardized formats and common metadata elements",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment104",
    "requirement id": 104,
    "description": "The system should be designed for access through browser-based systems and must                impose minimal requirements on the client device",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment105",
    "requirement id": 105,
    "description": "The system must support multiple types of communication services for remote access",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment106",
    "requirement id": 106,
    "description": "The system should have capability to support public access to a subset of data and                functionality",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment107",
    "requirement id": 107,
    "description": "The system should support multi-tier authentication where required",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment108",
    "requirement id": 108,
    "description": "The system should support SSL encrypted connections",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment109",
    "requirement id": 109,
    "description": "The system should support secure virtual private network connections",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment110",
    "requirement id": 110,
    "description": "The system should use HTTPS as the communication protocol, i.e., HTTP over an encrypted secure socket layer (SSL)",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment111",
    "requirement id": 111,
    "description": "The system should run on multiple browsers",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment112",
    "requirement id": 112,
    "description": "The system should support selective encryption of the stored data",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment113",
    "requirement id": 113,
    "description": "The system should ensure secure transmission of data over the network and utilize SSL and 2-way digital signatures",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment114",
    "requirement id": 114,
    "description": "The system should ensure high standards of security and access control through:            Prevent cross-site scriptingValidate the incoming data / user requestEncode the incoming data / user requestPrevent SQL InjectionUtilize parameterized queriesSanitize the user-inputsValidate the data both at the client and serverDo not allow hard delete and perform only soft tagging the row for deletion",
    "type": "functional",
    "project": "cctns"
  },
  {
    "title": "requirment115",
    "requirement id": 115,
    "description": "The system should ensure high scalability and performance through:            Use of cache for storing frequent dataUse of AJAX based technology to improve user experience. Aggressive page loading to be considered based on the screen and estimate usage patternLeverage Asynchronous HTTP socket capabilities of web server for scalability and performanceHost all the static content (documents, images) on the web serverThe search results should be fetched from the database in batches of 10 or 20 maximum                    as configured within the applicationDisplay of records on the screen in batches/paged mannerThe search should fetch only the fields that need to be displayed to the user. Only when                    the user clicks on a particular record to view its further details should a query be fired to                    fetch the additional details for this particular record onlyA hierarchical cache should be configured and used for caching of results of most frequently used searchesDatabase Indexes should be applied on the key columns used for searching",
    "type": "functional",
    "project": "cctns"
  }
]